# GetLabelOutline Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Viewport..::..GetLabelOutline Method
Viewport Class See Also
---
Gets the outline viewport's label on the sheet.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public Outline GetLabelOutline()
```

Visual Basic
---
```text
Public Function GetLabelOutline As Outline
```

Visual C++
---
```text
public:
Outline^ GetLabelOutline()
```

# ### Return Value
The outline of the viewport's label on the sheet. The outline may be empty if there is no label.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | The viewport is not on a sheet. |

# See Also
Viewport Class
Autodesk.Revit.DB Namespace